package com.javarush.task.task08.task0820;

import java.util.HashSet;
import java.util.Iterator;
import java.util.Set;

/* 
Множество всех животных
Множество всех животных
1. Внутри класса Solution создать public static классы Cat, Dog.
2. Реализовать метод createCats, который должен возвращать множество с 4 котами.
3. Реализовать метод createDogs, который должен возвращать множество с 3 собаками.
4. Реализовать метод join, который должен возвращать объединенное множество всех животных — всех котов и собак.
5. Реализовать метод removeCats, который должен удалять из множества pets всех котов, которые есть в множестве cats.
6. Реализовать метод printPets, который должен выводить на экран всех животных, которые в нем есть.
Каждое животное с новой строки
*/

public class Solution {
    public static void main(String[] args) {
        Set<Cat> cats = createCats();
        Set<Dog> dogs = createDogs();

        Set<Object> pets = join(cats, dogs);
        printPets(pets);

        removeCats(pets, cats);
        printPets(pets);
    }

    public static Set<Cat> createCats() {
        HashSet<Cat> result = new HashSet<Cat>();

        result.add(new Cat());
        result.add(new Cat());
        result.add(new Cat());
        result.add(new Cat());

        return result;
    }

    public static Set<Dog> createDogs() {
        Set<Dog> dogs = new HashSet<>();
        dogs.add(new Dog());
        dogs.add(new Dog());
        dogs.add(new Dog());
        return dogs;
    }

    public static Set<Object> join(Set<Cat> cats, Set<Dog> dogs) {
        Set<Object> animals =new HashSet<>();

        Iterator<Cat> iCat = cats.iterator();
        Iterator<Dog> iDog = dogs.iterator();

        while (iCat.hasNext()){
            animals.add(iCat.next());
        }

        while (iDog.hasNext()){
            animals.add(iDog.next());
        }

        return animals;
    }

    public static void removeCats(Set<Object> pets, Set<Cat> cats) {
        Iterator iCat = cats.iterator();
        while (iCat.hasNext()){
            pets.remove(iCat.next());
        }
    }

    public static void printPets(Set<Object> pets) {
        pets.forEach(pet-> System.out.println(pet));
    }

    public static class Cat{

    }

    public static class Dog{


    }
}
